app/views/users/index.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
                            <a href="/users/<%= user.id %>"><p class="student-username"> <%= user.username %> </p></a>
                            <p class="student-scrolls">Scrolls: <%= @count = Post.where(user_id: user.id).count %> </p>