app/controllers/application_controller.rb

    def current_user
        return unless session[:user_id]
        @current_user ||= User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]