app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @users = User.all
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"

  def create
    post = Post.new
    post.title = params[:title]
    post.subtitle = params[:subtitle]
    post.description = params[:description]
    post.user_id = current_user.id
    post.save
---
INSERT INTO "posts" ("title", "subtitle", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @post = Post.find(params[:id])
    @user = User.find_by(id: @post[:user_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]