app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"
---
  def index
    @users = User.all
    @posts = Post.all

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "roqdraw@gmail.com"], ["password", "elsalvador1992"], ["created_at", "2019-03-29 03:59:42.209915"], ["updated_at", "2019-03-29 03:59:42.209915"]]
---
  def create
    user = User.new
    user.username = params[:username]
    user.email = params[:email]
    user.password = params[:password]
    user.image_url = params[:image_url]
    user.first_name = params[:first_name]
    user.last_name = params[:last_name]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(id: session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    user = User.find_by(id: session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = Post.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def my_profile
    @user = User.find_by(id: session[:user_id])
    @posts = Post.where(user_id: current_user.id)